In [1]:
from sqlalchemy import create_engine
import pandas as pd

munst40_engine = create_engine(
    'mssql+pyodbc://Rakhimov:@localhost/munst40?trusted_connection=yes&driver=SQL+Server+Native+Client+11.0')
munst44_engine = create_engine(
    'mssql+pyodbc://Rakhimov:@localhost/munst44?trusted_connection=yes&driver=SQL+Server+Native+Client+11.0')
munst46_engine = create_engine(
    'mssql+pyodbc://Rakhimov:@localhost/munst46?trusted_connection=yes&driver=SQL+Server+Native+Client+11.0')
munst77_engine = create_engine(
    'mssql+pyodbc://Rakhimov:@localhost/munst77?trusted_connection=yes&driver=SQL+Server+Native+Client+11.0')
mysql_engine = create_engine("mysql://root:root@localhost:12345/test?charset=utf8")

In [2]:
# 1. Справочник показателей
# Сперва убираем записи с дубликатами для полей nompok, namepok, namefd и у которых c полями которые не должно быть not null стоит nulls
query = """
select s_pok.*
from s_pok
         JOIN (
    select kodpok_res.kodpok
    from (select res.kodpok
          from (select kodpok, count(*) as cnt
                from s_pok
                where namefd is not NULL
                  and kodpok is not NULL
                group by namefd, kodpok) as res
          where cnt = 1) as namefd_res
             JOIN (select res.kodpok
                   from (select kodpok, count(*) as cnt from s_pok where kodpok is not NULL group by kodpok) as res
                   where cnt = 1) as kodpok_res ON namefd_res.kodpok = kodpok_res.kodpok
             JOIN (select res.kodpok
                   from (select kodpok, count(*) as cnt
                         from s_pok
                         where kodpok is not NULL
                         group by namepok, kodpok) as res
                   where cnt = 1) as namepok_res ON kodpok_res.kodpok = namepok_res.kodpok) as filtere_res
              ON filtere_res.kodpok = s_pok.kodpok
WHERE kodksp is not null
  and kodei is not null
  and vidpok is not null
  and istpok is not null
  and tippok is not null
  and nompok is not null
  and maxzpok is not null
  and kzpok is not null
  and kodpolz is not null
  and datekor is not null
  and datevst is not null
  and namepole is not null
ORDER BY nompok;
"""
s_pok_munst40 = pd.read_sql(query, munst40_engine, parse_dates=['datekor', 'datevst'])
s_pok_munst44 = pd.read_sql(query, munst44_engine, parse_dates=['datekor', 'datevst'])
s_pok_munst46 = pd.read_sql(query, munst46_engine, parse_dates=['datekor', 'datevst'])
s_pok_munst77 = pd.read_sql(query, munst77_engine, parse_dates=['datekor', 'datevst'])

# Добавляем регион для каждой записи и гарантируется что для каждой записи UNIQUE(kodpok, region)
s_pok_munst40['region'] = "munst40"
s_pok_munst44['region'] = "munst44"
s_pok_munst46['region'] = "munst46"
s_pok_munst77['region'] = "munst77"

s_pok = s_pok_munst40.append(s_pok_munst44).append(s_pok_munst46).append(s_pok_munst77)
s_pok.sort_values(by='nompok')
s_pok.to_sql('s_pok', mysql_engine, if_exists='replace', index=False)
s_pok

,kodpok,kodksp,kodei,vidpok,istpok,tippok,nompok,maxzpok,kzpok,kodpolz,datekor,datevst,namefd,namepole,namepok,opispok,region
0,8019014,8019014,384,1,1,1,104,15,4,3000,2012-12-24,2012-12-24,8019014,zn8019014,Объем социальных выплат населению и налогообла...,,munst44
1,8112030,8112030,792,1,1,1,106,15,4,3000,2012-12-25,2012-12-25,8112030,zn8112030,Средний размер частного домохозяйства,,munst44
2,8112035,8112035,792,1,1,1,108,15,4,1000,2015-07-07,2012-12-25,8112035,zn8112035,Национальный состав населения,,munst44
3,8015007,8015007,746,1,1,1,110,15,4,3000,2012-12-25,2012-12-25,8015007,zn8015007,Уровень образования населения (на 1000 человек...,,munst44
4,8016006,8016006,642,1,1,1,1606,15,4,1000,2015-06-29,2012-12-13,8016006,zn8016006,Число обособленных подразделений (филиалов) му...,,munst44
5,8109016,9109016,384,1,1,1,5599,15,4,3000,2012-12-20,2012-12-20,8109016,zn8109016,Средства на долевое строительство населения,,munst44
6,8007025,8007025,1136,1,1,1,7025,15,4,1000,2016-05-25,2012-12-13,8007025,zn8007025,Урожайность сельскохозяйственных культур (в р...,,munst44
7,8109011,9109011,384,1,1,1,9011,15,4,3000,2012-12-14,2012-12-14,8109011,zn8109011,"Инвестиции в основной капитал, осуществляемые ...",,munst44
8,8109012,9109012,384,1,1,1,9012,15,4,3000,2012-12-14,2012-12-14,8109012,zn8109012,Инвестиции в основной капитал организаций мун...,,munst44
9,8109013,9109013,384,1,1,1,9013,15,4,3000,2012-12-14,2012-12-14,8109013,zn8109013,Объем инвестиций в основной капитал (за исключ...,,munst44
10,8109014,9109014,384,1,1,1,9014,15,4,3000,2012-12-14,2012-12-14,8109014,zn8109014,Средства на долевое строительство населения и ...,,munst44
11,8109015,9109015,384,1,1,1,9015,15,4,3000,2012-12-14,2012-12-14,8109015,zn8109015,Средства на долевое строительство населения и ...,,munst44
12,8213007,8213007,792,1,1,1,13007,15,4,3000,2013-01-23,2013-01-23,8213007,zn8213007,Среднемесячная номинальная начисленная заработ...,,munst44
13,8213008,8213008,792,1,1,1,13008,15,4,3000,2013-01-23,2013-01-23,8213008,zn8213008,Среднемесячная номинальная начисленная заработ...,,munst44
14,8014006,8014006,744,1,1,1,14006,15,4,1000,2016-01-25,2013-01-23,8014006,zn8014006,"Доля детей в возрасте 1-6 лет, получающих дошк...",,munst44
15,8016004,8016004,642,1,1,1,16004,15,4,1000,2015-06-29,2012-12-13,8016004,zn8016004,Число обособленных подразделений (филиалов) о...,,munst44
16,8016005,8016005,642,1,1,1,16005,15,4,1000,2015-06-29,2012-12-13,8016005,zn8016005,Число обособленных подразделений (филиалов) би...,,munst44
17,8017025,8017025,642,1,1,1,17025,15,4,3000,2012-12-13,2012-12-13,8017025,zn8017025,Число обособленных подразделений (филиалов) ...,,munst44
0,8019014,8019014,384,1,1,1,104,15,4,3000,2012-12-24,2012-12-24,8019014,zn8019014,Объем социальных выплат населению и налогообла...,,munst46
1,8112030,8112030,792,1,1,1,106,15,4,3000,2012-12-25,2012-12-25,8112030,zn8112030,Средний размер частного домохозяйства,,munst46
2,8112035,8112035,792,1,1,1,108,15,4,3000,2012-12-25,2012-12-25,8112035,zn8112035,Национальный состав населения,,munst46
3,8015007,8015007,746,1,1,1,110,15,4,3000,2012-12-25,2012-12-25,8015007,zn8015007,Уровень образования населения (на 1000 человек...,,munst46
4,8016006,8016006,642,1,1,1,1606,15,4,3000,2012-12-13,2012-12-13,8016006,zn8016006,Число обособленных подразделений музеев,,munst46
5,8112025,8112025,792,1,1,1,5044,15,4,3000,2012-12-20,2012-12-20,8112025,zn8112025,Численность детей в возрасте 1 - 6 лет в мун...,,munst46
6,8109016,9109016,384,1,1,1,5599,15,4,3000,2012-12-20,2012-12-20,8109016,zn8109016,Средства на долевое строительство населения,,munst46
7,8007025,8007025,1136,1,1,1,7025,15,4,1000,2015-03-27,2012-12-13,8007025,zn8007025,Урожайность сельскохозяйственных культур (в р...,,munst46
8,8109011,9109011,384,1,1,1,9011,15,4,3000,2012-12-14,2012-12-14,8109011,zn8109011,"Инвестиции в основной капитал, осуществляемые ...",,munst46
9,8109012,9109012,384,1,1,1,9012,15,4,3000,2012-12-14,2012-12-14,8109012,zn8109012,Инвестиции в основной капитал организаций мун...,,munst46
10,8109013,9109013,384,1,1,1,9013,15,4,3000,2012-12-14,2012-12-14,8109013,zn8109013,Объем инвестиций в основной капитал (за исключ...,,munst46
11,8109014,9109014,384,1,1,1,9014,15,4,3000,2012-12-14,2012-12-14,8109014,zn8109014,Средства на долевое строительство населения и ...,,munst46
12,8109015,9109015,384,1,1,1,9015,15,4,3000,2012-12-14,2012-12-14,8109015,zn8109015,Средства на долевое строительство населения и ...,,munst46
13,8213007,8213007,792,1,1,1,13007,15,1,3000,2013-01-23,2013-01-23,8213007,zn8213007,Среднемесячная номинальная начисленная заработ...,,munst46
14,8213008,8213008,792,1,1,1,13008,15,1,3000,2013-01-23,2013-01-23,8213008,zn8213008,Среднемесячная номинальная начисленная заработ...,,munst46
15,8014006,8014006,744,1,1,1,14006,15,4,3000,2013-01-23,2013-01-23,8014006,zn8014006,"Доля детей в возрасте 1-6 лет, получающих дошк...",,munst46
16,8014007,8014007,744,1,1,1,14007,15,4,3000,2013-01-23,2013-01-23,8014007,zn8014007,Доля муниципальных дошкольных образовательных ...,,munst46
17,8016004,8016004,642,1,1,1,16004,15,4,3000,2012-12-13,2012-12-13,8016004,zn8016004,Число обособленных подразделений организаций ...,,munst46
18,8016005,8016005,642,1,1,1,16005,15,4,3000,2012-12-13,2012-12-13,8016005,zn8016005,Число обособленных подразделений библиотек,,munst46
19,8017025,8017025,642,1,1,1,17025,15,4,3000,2012-12-13,2012-12-13,8017025,zn8017025,"Число обособленных подразделений детских, муз...",,munst46

In [3]:
# Вспомогательные справочники (обеспечивают защиту информации)
# 9. Справочник событий (s_sob)
query = """
select s_sob.nomsob, s_sob.datasob, s_sob.kodpolz as username, namesob
from s_sob join s_vidsob on s_sob.vidsob = s_vidsob.vidsob
"""
# Приводим kodpolz в string для объединения с остальними таблицами так как там стоит username
s_sob_munst40 = pd.read_sql(query, munst40_engine)
s_sob_munst46 = pd.read_sql(query, munst46_engine)
s_sob_munst40['username'] = s_sob_munst40['username'].astype(str)
s_sob_munst40['region'] = 'munst40'
s_sob_munst46['username'] = s_sob_munst46['username'].astype(str)
s_sob_munst46['region'] = 'munst46'

query = """
select res.nomsob as nomsob, res.datasob, username, res.namesob  from (select s_sob.nomsob, s_sob.datasob, s_sob.kodpolz, namesob
from s_sob join s_vidsob on s_sob.vidsob = s_vidsob.vidsob) as res join s_polz on res.kodpolz = s_polz.kodpolz;
"""
s_sob_munst44 = pd.read_sql(query, munst44_engine)
s_sob_munst77 = pd.read_sql(query, munst77_engine)
s_sob_munst44['region'] = 'munst44'
s_sob_munst77['region'] = 'munst77'

s_sob = s_sob_munst40.append(s_sob_munst44).append(s_sob_munst46).append(s_sob_munst77)
s_sob.to_sql('s_sob', mysql_engine, if_exists='replace', index=False)
s_sob

,nomsob,datasob,username,namesob,region
0,1,2007-04-10 15:48:55.063,9001,Добавить число в фонд данных,munst40
1,2,2007-04-10 15:48:55.063,9001,Изменить число в фонде данных,munst40
2,3,2007-04-10 16:02:56.783,9001,Добавить число в фонд данных,munst40
3,4,2007-04-10 16:02:56.783,9001,Изменить число в фонде данных,munst40
4,5,2007-04-10 16:04:11.317,9001,Добавить число в фонд данных,munst40
...,...,...,...,...,...
13695,11999,2018-08-23 10:10:05.410,adm2003,Добавить число в фонд данных,munst77
13696,12000,2018-08-23 10:10:05.430,adm2003,Изменить число в фонде данных,munst77
13697,12001,2018-08-23 10:10:06.513,adm2003,Добавить число в фонд данных,munst77
13698,12002,2018-08-23 10:10:06.513,adm2003,Изменить число в фонде данных,munst77
13699,12014,2018-08-24 17:41:15.840,adm2003,Корректировка данных из выходной таблицы,munst77

In [4]:
# 2. Справочник вхождений показателей (s_pok_v)
# Сперва убираем записи не являющиеся unique_together(kodpokn, kodpokn) а потом Join-им с симим собой для получения nompokv
# а потом упорядочиваем по kodpokv, kodpokn
query = """
select s_pok_v.*
from (select kodpokn, kodpokv from s_pok_v group by kodpokn, kodpokv having count(*) <= 1) as res
         join s_pok_v on res.kodpokv = s_pok_v.kodpokv and res.kodpokn = s_pok_v.kodpokn
where res.kodpokv is not null
  and res.kodpokn is not null
  and nompokv is not null
order by s_pok_v.kodpokv, s_pok_v.nompokv
"""

s_pok_v_munst40 = pd.read_sql(query, munst40_engine)
s_pok_v_munst44 = pd.read_sql(query, munst44_engine)
s_pok_v_munst46 = pd.read_sql(query, munst46_engine)
s_pok_v_munst77 = pd.read_sql(query, munst77_engine)
s_pok_v_munst40['region'] = 'munst40'
s_pok_v_munst44['region'] = 'munst44'
s_pok_v_munst46['region'] = 'munst46'
s_pok_v_munst77['region'] = 'munst77'
s_pok_v = s_pok_v_munst40.append(s_pok_v_munst44).append(s_pok_v_munst46).append(s_pok_v_munst77)
s_pok_v.sort_values(by=['kodpokv', 'kodpokn'])
s_pok_v.to_sql('s_pok_v', mysql_engine, if_exists='replace', index=False)
s_pok_v

     kodpokn  kodpokv  nompokv   region
0         42        0       10  munst40
1         43        0       20  munst40
2         31        0       30  munst40
3         32        0       40  munst40
4         33        0       50  munst40
..       ...      ...      ...      ...
649  8131064       80      390  munst77
650  8131065       80      400  munst77
651  8131066       80      410  munst77
652  8131067       80      420  munst77
653  8131068       80      430  munst77

[2553 rows x 4 columns]

In [5]:
# Справочник единиц измерения (s_ei)
# Убираем not unique записи по kodie и nameei и order by по nameii
# Тут MAX() изпользуеться как алтернатива для ANY_VALUE в mysql
# так как из-за count в окошко попадает только одно значеие MAX возвращает его
query = """
select s_ei.*
from (select max(nameei) as nameii
      from (select s_ei.*
            from (select max(kodei) as kodei
                  from s_ei
                  group by kodei
                  having count(*) = 1) as res
                     join s_ei on s_ei.kodei = res.kodei) as res
      group by nameei
      having count(nameei) = 1) as res
         join s_ei on s_ei.nameei = res.nameii
where kodei is not null and grei is not null and koefei is not null
order by nameei
"""

s_ei_munst40 = pd.read_sql(query, munst40_engine)
s_ei_munst44 = pd.read_sql(query, munst44_engine)
s_ei_munst46 = pd.read_sql(query, munst46_engine)
s_ei_munst77 = pd.read_sql(query, munst77_engine)

s_ei_munst40['region'] = 'munst40'
s_ei_munst44['region'] = 'munst44'
s_ei_munst46['region'] = 'munst46'
s_ei_munst77['region'] = 'munst77'
s_ei = s_ei_munst40.append(s_ei_munst44).append(s_ei_munst46).append(s_ei_munst77)
s_ei.to_sql('s_ei', mysql_engine, if_exists='replace', index=False)
s_ei

    kodei  grei    koefei                              nameei   region
0       1     1     1.000                                   -  munst40
1      59    59     1.000                              гектар  munst40
2     233   233     1.000                         гигакалория  munst40
3     836   836     1.000                              голова  munst40
4     163   166  1000.000                               грамм  munst40
..    ...   ...       ...                                 ...      ...
41    798   796     0.001                         тысяча штук  munst77
42    206   206     1.000                             центнер  munst77
43   1136  1136     1.000  центнер с гектара убранной площади  munst77
44    792   792     1.000                             человек  munst77
45    796   796     1.000                               штука  munst77

[183 rows x 5 columns]

In [6]:
# Справочник видов статистической информации (s_vid)
# Проверка на unique_together(vidpok, namevid) и order by по namevid
query = """
select *
from s_vid
where vidpok is not null
group by vidpok, namevid
having count(namevid) = 1
order by namevid
"""
# Так как s_vid статическая таблица во всех базах они должны быть одинаковыми
# Поетому можно выбрать лубою из четырех баз, но в нашем случае она пуста(
s_vid = pd.read_sql(query, munst40_engine)
s_vid.to_sql('s_vid', mysql_engine, if_exists='replace', index=False)
s_vid

Empty DataFrame
Columns: [vidpok, namevid]
Index: []

In [7]:
# Справочник источников статистической информации (s_ist)
# Точно такая же логика как у s_vid
query = """
select *
from s_ist
where istpok is not null
group by istpok,nameist
having count(nameist) = 1
order by nameist
"""

s_ist = pd.read_sql(query, munst40_engine)
s_ist.to_sql('s_ist', mysql_engine, if_exists='replace', index=False)
s_ist

Empty DataFrame
Columns: [istpok, nameist]
Index: []

In [8]:
# Справочник типов показателей (s_tip)
# Тут тоже та логика
query = """
select *
from s_tip
where tippok is not null
group by tippok, nametip
having count(nametip) = 1
order by nametip
"""

s_tip = pd.read_sql(query, munst40_engine)
s_tip.to_sql('s_tip', mysql_engine, if_exists='replace', index=False)
s_tip

Empty DataFrame
Columns: [tippok, nametip]
Index: []

In [9]:
# Справочник признаков (Территории, Тип поселения, Пол, Возраст и т.д.)

query = """
select s_prizn.*
from (select namesprav, nameprizn
      from s_prizn
      where przpr is not null
        and namesprav is not null
        and nameprizn is not null
      group by namesprav, nameprizn
      having count(nameprizn) = 1) as res
         join s_prizn on res.nameprizn = s_prizn.nameprizn and res.namesprav = s_prizn.namesprav
order by s_prizn.nameprizn
"""

s_prizn_munst40 = pd.read_sql(query, munst40_engine)
s_prizn_munst44 = pd.read_sql(query, munst44_engine)
s_prizn_munst46 = pd.read_sql(query, munst46_engine)
s_prizn_munst77 = pd.read_sql(query, munst77_engine)

s_prizn_munst40['region'] = 'munst40'
s_prizn_munst44['region'] = 'munst44'
s_prizn_munst46['region'] = 'munst46'
s_prizn_munst77['region'] = 'munst77'
s_prizn = s_prizn_munst40.append(s_prizn_munst44).append(s_prizn_munst46).append(s_prizn_munst77)
s_prizn.to_sql('s_prizn', mysql_engine, if_exists='replace', index=False)
s_prizn

,namesprav,nameprizn,przpr,kodtipzpr,region
0,spzakpr,Cпособы размещения заказов на поставки товаров...,0,4,munst40
1,spzakmp,Cпособы размещения заказов среди суб.мал. пред...,0,4,munst40
2,vidzych,Вид заявок участника торгов,0,4,munst40
3,migr,Вид миграции,0,4,munst40
4,vidfond,Вид основных фондов,0,4,munst40
...,...,...,...,...,...
52,sptorg,Торги и другие способы размещения заказов,0,4,munst77
53,obras,Уровень образования,0,4,munst77
54,wetwl,Уровни управления,0,4,munst77
55,ucheb,Участники,0,4,munst77
56,kfs,Формы собственности,0,4,munst77

In [10]:
# Справочник разрезов (s_raz)

query = """
select *
from s_raz
where kodraz is not null
  and namesprav is not null
  and nomraz is not null
order by nomraz;
"""

s_raz_munst40 = pd.read_sql(query, munst40_engine)
s_raz_munst44 = pd.read_sql(query, munst44_engine)
s_raz_munst46 = pd.read_sql(query, munst46_engine)
s_raz_munst77 = pd.read_sql(query, munst77_engine)
s_raz_munst40['region'] = 'munst40'
s_raz_munst44['region'] = 'munst44'
s_raz_munst46['region'] = 'munst46'
s_raz_munst77['region'] = 'munst77'
s_raz = s_raz_munst40.append(s_raz_munst44).append(s_raz_munst46).append(s_raz_munst77)
s_raz.to_sql('s_raz', mysql_engine, if_exists='replace', index=False)
s_raz

,kodraz,namesprav,nameraz,nomraz,region
0,1,spzakmp,Всего по торгам и запросам котировок,10,munst44
1,2,spzakmp,Открытые конкурсы,20,munst44
2,3,spzakmp,Закрытые конкурсы,30,munst44
3,4,spzakmp,Открытые аукционы,40,munst44
4,5,spzakmp,Закрытые аукционы,50,munst44
5,11,spzakmp,Открытые аукционы в электронной форме,55,munst44
6,6,spzakmp,Запрос котировок,60,munst44

In [11]:
# Справочник признаков показателей (s_pok_prizn)
query = """
select *
from s_pok_prizn
order by kodpok, nomprfd;
"""

s_pok_prizn_munst40 = pd.read_sql(query, munst40_engine)
s_pok_prizn_munst44 = pd.read_sql(query, munst44_engine)
s_pok_prizn_munst46 = pd.read_sql(query, munst46_engine)
s_pok_prizn_munst77 = pd.read_sql(query, munst77_engine)
s_pok_prizn_munst40['region'] = 'munst40'
s_pok_prizn_munst44['region'] = 'munst44'
s_pok_prizn_munst46['region'] = 'munst46'
s_pok_prizn_munst77['region'] = 'munst77'
s_pok_prizn = s_pok_prizn_munst40.append(s_pok_prizn_munst44).append(s_pok_prizn_munst46).append(s_pok_prizn_munst77)
s_pok_prizn.drop_duplicates(subset=['kodpok', 'namesprav', 'nomprfd'])
s_pok_prizn.to_sql('s_pok_prizn', mysql_engine, if_exists='replace', index=False)
s_pok_prizn

       kodpok             namesprav  nomprfd   region
0     8001001  munr                        1  munst40
1     8001001  tippos                      2  munst40
2     8001001  oktmo                       3  munst40
3     8001001  uslug                       4  munst40
4     8001001  god                         5  munst40
...       ...                   ...      ...      ...
3491  8942019  oktmo                      30  munst77
3492  8942019  okved2                     40  munst77
3493  8942019  kfs                        50  munst77
3494  8942019  god                        60  munst77
3495  8942019  period                     70  munst77

[13704 rows x 4 columns]

In [12]:
# Справочники значений признаков (p_[namesprav])
query = """
SELECT *
FROM INFORMATION_SCHEMA.TABLES
where TABLE_SCHEMA = 'dbo'
  and TABLE_TYPE = 'BASE TABLE';
"""
p_namesprav_tables_munst40 = pd.read_sql(query, munst40_engine)
p_namesprav_tables_munst44 = pd.read_sql(query, munst44_engine)
p_namesprav_tables_munst46 = pd.read_sql(query, munst46_engine)
p_namesprav_tables_munst77 = pd.read_sql(query, munst77_engine)
pattern = r"^p_[A-Za-z0-1]+$"
p_namesprav_tables_munst40 = p_namesprav_tables_munst40[p_namesprav_tables_munst40['TABLE_NAME'].str.contains(pattern)]
p_namesprav_tables_munst44 = p_namesprav_tables_munst44[p_namesprav_tables_munst44['TABLE_NAME'].str.contains(pattern)]
p_namesprav_tables_munst46 = p_namesprav_tables_munst46[p_namesprav_tables_munst46['TABLE_NAME'].str.contains(pattern)]
p_namesprav_tables_munst77 = p_namesprav_tables_munst77[p_namesprav_tables_munst77['TABLE_NAME'].str.contains(pattern)]

p_namesprav_munst40_data = None
for table_name in p_namesprav_tables_munst40['TABLE_NAME']:
    query = f"""
    select {table_name}.*
        from (select kodzpr, namezpr from {table_name} group by kodzpr, namezpr having count(*) = 1) as res
        join {table_name} on {table_name}.kodzpr = res.kodzpr and {table_name}.namezpr = res.namezpr order by nomzpr
    """
    data = pd.read_sql(query, munst40_engine)
    data['namesprav'] = table_name
    # print(data)
    if p_namesprav_munst40_data is None:
        p_namesprav_munst40_data = data
    else:
        p_namesprav_munst40_data = p_namesprav_munst40_data.append(data)

p_namesprav_munst44_data = None
for table_name in p_namesprav_tables_munst44['TABLE_NAME']:
    query = f"""
    select {table_name}.*
        from (select kodzpr, namezpr from {table_name} group by kodzpr, namezpr having count(*) = 1) as res
        join {table_name} on {table_name}.kodzpr = res.kodzpr and {table_name}.namezpr = res.namezpr order by nomzpr
    """
    data = pd.read_sql(query, munst44_engine)
    data['namesprav'] = table_name
    # print(data)
    if p_namesprav_munst44_data is None:
        p_namesprav_munst44_data = data
    else:
        p_namesprav_munst44_data = p_namesprav_munst44_data.append(data)

p_namesprav_munst46_data = None
for table_name in p_namesprav_tables_munst46['TABLE_NAME']:
    query = f"""
    select {table_name}.*
        from (select kodzpr, namezpr from {table_name} group by kodzpr, namezpr having count(*) = 1) as res
        join {table_name} on {table_name}.kodzpr = res.kodzpr and {table_name}.namezpr = res.namezpr order by nomzpr
    """
    data = pd.read_sql(query, munst46_engine)
    data['namesprav'] = table_name
    # print(data)
    if p_namesprav_munst46_data is None:
        p_namesprav_munst46_data = data
    else:
        p_namesprav_munst46_data = p_namesprav_munst46_data.append(data)

# Тут нужно привести text в varchar(255) из-за namezpr в p_migr
p_namesprav_munst77_data = None
for table_name in p_namesprav_tables_munst77['TABLE_NAME']:
    query = f"""
    select {table_name}.*
from (
         select kodzpr, CAST(namezpr as varchar(255)) as namezpr
         from {table_name}
         group by kodzpr, CAST(namezpr as varchar(255))
         having count(*) = 1
     ) as res
         join {table_name}
              on {table_name}.kodzpr = res.kodzpr and CAST({table_name}.namezpr as varchar(255)) = res.namezpr
order by nomzpr
    """
    data = pd.read_sql(query, munst77_engine)
    data['namesprav'] = table_name
    # print(data)
    if p_namesprav_munst77_data is None:
        p_namesprav_munst77_data = data
    else:
        p_namesprav_munst77_data = p_namesprav_munst77_data.append(data)
p_namesprav_munst40_data['region'] = 'munst40'
p_namesprav_munst44_data['region'] = 'munst44'
p_namesprav_munst46_data['region'] = 'munst46'
p_namesprav_munst77_data['region'] = 'munst77'

p_namesprav = p_namesprav_munst40_data.append(p_namesprav_munst44_data).append(p_namesprav_munst46_data).append(
    p_namesprav_munst77_data)
p_namesprav.to_sql('p_namesprav', mysql_engine, if_exists='replace', index=False)
p_namesprav